
 
content = '''
网页

搜狗搜索 
Qzone 
Qmail 
登录 
新闻 
视频 
图片 
军事 
体育 
NBA 
娱乐 
财经 
科技 
时尚 
汽车 
房产 
教育 
文化 
游戏 
星座 
更多



 

要闻

北京新闻
北京

26℃
H5丨致敬共和国英雄！习近平铸就“中国信仰” 
微视频：时代勋章 
习近平将出席烈士纪念日向人民英雄敬献花篮仪式 
共和国勋章，惊艳！ 长风破浪会有时 理上网来 
《我们走在大路上》 第二十一集 第二十二集 
粮食产量有望连续5年超1.3万亿斤| 庆祝新中国成立70年 
中国经济高质量发展吸引全球目光 中国保持就业稳定有基础 
一天24小时，上海在发生什么 中华人民共和国大事记 
 
中国与基里巴斯共和国恢复外交关系 

外交部长谈中国与基里巴斯复交：经历风雨，彩虹更灿烂 
注意！十一长假部分景区只在线售票 别白跑一趟 
不只有黑科技！大兴机场还是个“艺术博物馆” 
下半年9地出台住房租赁新规：增加供给，严打“黑中介” 
香港特区立法会建制派议员联署反对美涉港法案 
洪秀柱台南造势直言“不怯战”：要努力为台湾做实事 
 
美国会再次通过决议叫停南部边境“国家紧急状态” 

拜登借“电话门”拉抬声势 自称是特朗普最怕的对手 
59元买进4999元转手 盲盒是赚钱捷径还是交智商税 
男子越狱潜逃32年 被抓时已娶妻生子成建筑公司老板 
麦当劳“人造肉”汉堡来了！35元一个，你会买账吗？ 
爆笑一刻！行李箱机场跑道上演“大逃亡” 跑得停不下来 
今日话题 
16岁的瑞典少女格蕾塔不该只受到嘲讽 
瞭望| 蒙眼踢正步……这支阅兵方队这样训练！ 
央视新闻| 国庆出行，如何避开汹涌人潮？这份指南请收好 
沸腾| 周董MV奶茶店外，不该只有黄牛和“韭菜” 
新京报评论| 推广ETC收费，也需不断提高精准识别能力 
较真| 有种迷药让你“一闻就倒”？我信了你的邪 
财看见| 同为保障性住房 公租房和廉租房到底有啥区别？ 
 
 


汪苏泷liveshow纯享版：开口脆 听完秒入坑 

[心酸] 无法解决异地恋问题 听到男朋友想放弃女生无声落泪 
[甜蜜]婚宴寿宴一起办 这届老年人结婚比年轻人潮多了 
财约你| 冯仑：人的长相够用就行 太好看是非多 
力量·潜能者| 邹市明访中俄边境：有国家才有现在的我 
青潮魂动| 工作狂设计师365天轮轴转，只过年休息 
图话 
 
中国志愿者：我在柬埔寨排雷 这里有600万颗战争遗留地雷 
中国人的一天 第3564期 
鹅眼| 世界最大云南铁杉首次公开全貌：树龄超1100年 
谷雨| 他们人生低谷创潮牌 三年内产品火爆半个娱乐圈 
体坛| 跌入谷底的武磊不该被群嘲 这是人性最真实的一面 
认真映画| 女星孕期工作：蔡少芬复红，而她却被骂 
时尚圈| 简单耐看的半身裙穿搭，平凡中透露着优雅气质 
新闻APP
体育APP
企鹅号
快报
视频
浏览器
微视
微信
QQ
空间
企业微信
邮箱
腾讯云
电脑管家
会员
LOL
DNF
CF
王者
单机游戏
火影OL
天刀
爱玩
逆战
软件
Q币
京东
腾讯地图
腾讯文档
理财通
全部
展开
享看
QQ拼音
QQ影音
QQ影像
微云
企鹅FM
QQ阅读
QQ音乐
全民K歌
手机空间
手机QQ
QQ飞车
英雄
龙之谷
FIFA
魂斗罗
CF手游
天龙手游
星钻
QQ彩票
彩贝
时光画轴
天气
用户社区
海豚智音
热门赛事 
9月28日 中午好，今天有53场热门比赛 
 

田径世锦赛苏炳添惊险晋级百米半决赛

哈登韦少媒体日拍照花絮 双少时隔7年再度合体 
詹姆斯媒体日接受采访：斯台普斯才是今夏最大赢家 
杜兰特确认本赛季不打 对其他追求者只考虑几秒 
《东洋漫谈》惠若琪告诉你中国女排为啥这么稳 
张常宁卧推120公斤？视频实锤是真的！姚明才150公斤 
今日热播 
 

阅兵训练场7大名场面合辑

 

男子碰瓷结果车开太快没碰上

姨妈回应涠洲岛失联女孩微信对话内容：像约好坐船离开 
上海开市客开业一月后：没了飞天茅台爱马仕 人也少了 
一名男子深夜掀开公墓墓板 用陪葬手机给自己转账被抓 
三名男子深夜组团偷小羊 偷走一只嫌不够吃又偷一只 
男子边跑边用塑料板挡车牌 监控拍下他的“广场舞”步伐 
视觉焦点 

 
76岁老夫妻留守深山，养猪种地慢慢干不觉累，田鼠风干成美味
 
歼11隐身能力为何比F22逊色那么多？军方最新酷炫照揭示真相
 
女性选择衣服有讲究，不同时期穿搭不同的风格，但一定要有亮点
 
秦岚穿水墨风衣出征时装周大展东方美 踩细高跟蹲地逗娃超有爱
 
班克西名画《黑猩猩下议院》将在英国被拍卖，估价200万英镑
 
澳洲推翻持续119年律例，通过堕胎合法法案，此前堕胎被控谋杀






娱乐 电视剧 电影 音乐 
贵圈 懂小姐 认真映画 
 
 
冯绍峰自曝儿子已经会认爸爸，双手扑腾父子对视傻笑
公子翼Kong 
10月北美院线全面前瞻：DC《小丑》重磅领衔！
刚开始是恐怖片，中间是邪典片，最后竟然是哲学片
脱口秀行业会出现下一个“德云社”吗？
男星被泼硫酸后又被殴打致失明，退隐后靠领补助金度日
一线丨《攀登者》首映 吴京刚宠完小粉丝就遭张译嘲“唠叨”
看《中餐厅3》两个未播片段，节目是否作秀一目了然
错别字太离谱，王一博被曝只有小学毕业？时间线说明真相

迎娶年下24岁的女友，J家偶像又宣布结婚一个
郭碧婷向佐大婚成为“楚门秀”：流量与资本的一场联姻？
刘涛清宫造型曝光，气质秒杀杨幂、Baby？
从《琅琊榜2》到《十年三月三十日》，遗珠终于发光
父女恋修成正果！48岁男星发布婚讯，娶小24岁写真女偶像
范冰冰复出失败？品牌方删除官宣微博，网传总部已开始追责
十月院线大片挤爆，最诱人的是这8部新片！
体育 世界杯 CBA 英超 社区 
电竞视频 男篮世界杯 超级企鹅联盟 特步企鹅跑 
 
 
《女排面孔》魏秋月：最美队长！三朝元老几经手术终涅槃
腾讯体育 
新赛季战力榜：快船雄鹿爵士前三 火箭第四湖人第五
穆帅已经拒绝多份邀约 不愿接手小球队 等待皇马终极报价
英媒：国际足联推动中国举办2030年世界杯 遭到欧足联反对
今日份的装X！伊布胸部停球后模仿黑客帝国经典动作
曝青岛正接触哈德森 CBA万分外援有望八年后重返老东家
举重世锦赛中国队夺29金刷15项世界纪录 创历史最佳战绩
赛事直播 


精彩回放 
CBA 英超 
18-19赛季NBA回顾今天09:0018-19赛季NBA西部决赛比赛回顾：勇士vs开拓者
女排世界杯第三阶段今天14:00中国女排vs塞尔维亚
官方：前申花外援瓜林加盟巴甲劲旅 自由身免转会费
哈登：我和韦少都能打好无球 参加东京奥运会是目标之一
多哈田径世锦赛苏炳添百米10秒21 小组第5仍晋级
签约裁员汇总：安德森合同细节曝光 雷霆裁掉火箭旧将
伤病汇总：高富帅将接受负荷管理 骑士新秀缺席4-6周
巴媒：斯科拉里明年可能重返中国执教
眼光犀利的郎平教练 一直对20岁的山东姑娘杨涵玉赞赏有加

为你推荐


 
11.59万起，马自达最火的一台车，全新一代上市 
有车以后 0评论 

新英雄是卢锡安老婆赛娜？锤石的灯笼漏气了？

湖北公安：以我此生忠诚，护您盛世安宁！

湖人新赛季媒体日 詹皇浓眉领衔四巨头合影

曾怒怼"港独"分子的希腊大叔 受邀来北京观看大阅兵！

10月运势最旺的三大生肖，鸿运来啦！

适合小众打卡的景点，带上帐篷，不辜负绝美夜景！

国王将帅盼终结13年耻辱 福克斯：这是现实期望

92㎡现代轻奢，旧房改造得好，生活品质有提高

 
北京竟有几处5A级景区，你去过吗，哪一处最赞？ 
田里守望者QP 0评论 

明天要颁发的共和国勋章到底长啥样？

动漫图片：小新吃东西，儿时的欢乐看过举手

书谱的十个秘密，你都知道吗？

猫咪出去求偶失败，瘫坐在地上，眼神呆滞，废猫一条

公认“省油王”，满油跨省跑，噪音接近0，比雅阁受欢迎

微观纳米白炽灯或成为新一代半导体

老詹看了要锤你！詹姆斯大儿子把妹妹装进书包背回家

新报告：新零售时代下，快消行业怎样做好品牌运营？

 
史上最勤奋皇帝，为批奏折，一生写了4000多万字 
无风起念 0评论 

做一盘“鸿运当头”，剁椒鱼头让你欲罢不能
财经 证券 理财 
第一财经 界面新闻 每日经济新闻 财约你 
 
 
白宫考虑将中概股在美除牌，市场人士认为难以实施
第一财经 
联邦快递飞行员欲携带弹药被捕 盈利不及预期利润下滑8.8％
国庆黄金周铁路预计发送旅客1.42亿人次 同比增长8.8％
中国铁路“复兴路”
挂牌量近10万套、网签量下降1/4，北京二手房议价空间加大
柳青、孙宏斌、程维……那些从柳门底下“出逃”的人
进击的京东方
上证综指 
+3.08+0.11% 
道琼斯 
-70.87-0.26% 
恒生指数 
-87.12-0.33% 
腾讯济安 
+12.19+0.62% 
基金：深耕20年 资产管理规模超27万亿
券商：中国资本市场唱主角
Facebook华人员工跳楼引抗议 拼命工作却面临辞退
25岁！重庆上市公司最年轻董事长上任 A股有6位90后创二代
老板娘“炫富”，亏损裁员！蔚来的未来在哪？
美国又发起“337调查”，涉及TCL、海信、联想！公司回应
投资大鳄费舍尔：弹劾特朗普不会终结美股牛市
军事 
 

假借“民主”“人权” 霸道干涉中国内政
海外网
讲述强军故事 点亮强军梦想
迎国庆，赛场争锋燃激情
国防部神预测？美军机昨日被曝在台湾海峡搞小动作
这首歌，要火！
叙利亚精锐部队接受俄军训练 皮卡火箭炮火力强悍
航天科技战线6人、6集体被授予“最美奋斗者”称号
NBA 
NBA视频 TOP时刻 数据中心 
 
 
直击湖人媒体日：比去年收敛很多 新援依旧感叹排场真大
腾讯体育 
巴特勒：我不是一个坏人 想在热火延续韦德的遗产
国王将帅盼终结13年耻辱 福克斯：这是现实期望
篮网新赛季媒体日 杜兰特欧文有爱互动状态良好
库里：还没感觉到一哥已离开 当然欢迎他回到勇士
美媒评NBA历史50大巨星：詹皇仅逊乔丹 库里第10超科比
杜兰特：勇士和快船我只考虑过几秒钟 最后只想在篮网打球
赛事直播 


精彩回放 
NBA 
18-19赛季NBA回顾今天直播18-19赛季NBA西部决赛比赛回顾：勇士vs开拓者
18-19赛季NBA回顾09-2909:0018-19赛季NBA东部决赛比赛回顾：雄鹿vs猛龙
欲复刻麦蒂打板暴扣 但这球抛到计时器上太尴尬了
姚明当年如何应对批评 唯一的办法就是把比赛打好
詹姆斯历届中国赛回顾 从22岁生猛小皇帝到35岁“老詹”
终于当上老大了！巴特勒带热火众将训练 不断大叫指挥
社交圈：詹皇已非联盟第一人 三旬老汉要开始走下坡路？
库兹马因脚伤缺席NBA中国赛 最快10月中旬复出
大家 
 

大家｜了不起的盖茨，首富退休指南
腾讯大家1评
大家｜西门庆有再多的钱，也买不来荣国府的贵气
大家 | 贝聿铭设计的、有“四绝”的香山饭店只有四星
大家｜日本人喜欢走的小路
大家 | 如果他摔下去，只有死路一条
大家丨其实，喜欢比爱更宽广更长久
科技 科普 
产品+ 创投圈 AI行业精选 电脑管家 
 
 
谷歌、IBM们的“量子争霸”迷局：大打舆论战 技术突破太难
硅谷密探 
晚点独家｜蔚来的亏损数字游戏：研发成本并非主要原因
吴晓波15亿交易黄了 “最赚钱的财经作家”还想上市
一个胎死腹中的电子烟创业梦
溢价超百倍，真有人在“炒盲盒”？
新报告：新零售时代下，快消行业怎样做好品牌运营？
科大讯飞蜕变：“人工智能第一股”初养成
我走遍东京的奶茶店，弄明白了为啥日本人爱上了珍珠奶茶

集体走红的新茶饮品牌，为什么越来越像？
直播仍是风口，从实时音视频技术看未来趋势
传Facebook跳楼自杀员工曾遭欺凌 抗议者为死者寻求公道
业绩不达标 甲骨文三大高管被降薪98%
从“见字如面”到“万物互联”，这中间发生了什么？
电脑游戏作为“创造体验的装置”
SpaceX星际飞船原型即将完成组装 马斯克要召开发布会
时尚 
 

高圆圆宋慧乔金高银为啥这么耐看？原来是因为这个特征
DUOMIFASHION
黄梦莹搭档孙坚演技大获好评，剧外穿搭初恋感十足
秋季想要美得高调？卫衣搭短靴，特别显范
李菲儿秀秋装，开洞T恤搭宽松背带裤，秋天这么穿时髦透气
吉克隽逸扎哪吒头穿豹纹短裙，配中筒靴走机场时髦前卫
趁秋意正浓，囤点黑色皮衣，演绎都市时尚主义
秦岚又将风衣＋铆钉鞋穿火了，时尚又高级，女神范十足
汽车 
重磅新车 车型大全 精彩视频 汽车商城 
 
 
“国产雷克萨斯”！8月卖出10754台，仅6.29万元起售
车无涯 
公认“省油王”，满油跨省跑，噪音接近0，比雅阁受欢迎
11.59万起，马自达最火的一台车，全新一代上市
11.6万提19款宝来，用车7天，车主：比思域帅，油耗很意外
EXEED星途LX超智越级SUV预售开启
全新飞度/宝马3系旅行车领衔 多款重磅新车将于发布
11.68万拥有50万档次，奔驰内饰＋宝马引擎，关键终身质保
特斯拉警车时速近200km/h，追捕嫌疑犯，没电只能取消

30万能买到的行政豪车，探店对比S90、CT6、捷豹XFL
20万最舒服的选择，怎能少了它？
中国最嚣张的越野车，价格逐年增高，销量却相当一般！
新款奇瑞观致5S正式上市
国足门将醉驾被重罚，禁赛拘役4个月，开车不喝酒要牢记
遇到交通事故，别只顾着慌，这5通电话一定要打
哈弗H2国六版上市，新车延续了现款车型的设计风格
房产 
 

下半年9地出台住房租赁新规：增加供给，严打“黑中介”

地产央企跟紧变革大势走向业务多元化
听冯叔聊“中国式老有所依”
低利率推动下，新房数据再获突破性进展，各项数据接连增长
改变城市的房地产
多重政策叠加 楼市运行平稳
中国四大城市群，聚集了最优质的资源，占到全国一半的GDP
综艺 电视剧 电影 少儿 
动漫 体育 纪录片 风味人间 

中餐厅3·明言明语

VIP
2019-09-27 期

2019-09-27 期
VIP
好声音·中国风说唱
王力宏携爱徒唱《华人万岁》
嘉宾：王力宏 李荣浩 那英

2019-09-27 期
VIP
声入人心·经典老歌
二重唱《心恋》甜化张惠妹
嘉宾：尚雯婕 张惠妹 廖昌永

2019-09-26 期
自制
演员请就位·导演篇
杨幂恩师用沙溢拍《雷雨》
嘉宾：李少红 沙溢

2019-09-22 期
自制
脱口秀·腾叔本人了
徐峥模仿沈腾“你过来呀”
嘉宾：于谦 吴昕 李诞







教育 
 

大学读这4个专业，毕业不愁找工作，都是“铁饭碗”
小云乐乐
国庆幼儿园放8天，那么该不该退伙食费，可以讨要吗？
2020国考招警即将启动，基本条件你符合吗？
有些家长不管孩子，成绩反而越来越好，这是为什么呢？
高考考上985和211的学生后来工作都怎样了？
为什么初中地理和高中地理一个天一个地？学生：我太难了
历史 
 

史上最勤奋皇帝，为批奏折，一生写了4000多万字
无风起念
男子带印章上节目鉴宝，却遭专家怒批：你这是来炫富的？
为什么说篡汉的新朝皇帝王莽才是兴复汉朝的“最大功臣”？
欧洲画报看日俄战争
隋唐英雄雄阔海的双斧到底有多厉害，让麻叔谋一命呜呼？
女真“王牌水军”：一边给宋朝进贡，一边去日本当海盗
文化 新国风 
 

这群上海大学生天马行空，他们为共享单车赋予新生命
上观新闻
如何把字写“活”？
宋江与晁盖真的一直是好兄弟吗？晁盖临终时已经看透了
善忘，是一种大智慧！
看淡所有，珍惜拥有
他在中国的名气并不大，却与阿加莎、柯南·道尔并称三巨匠
星座 今日运势 
 

追爱指南：三招套牢精分双子，做TA恋人只吃糖不苦
腾讯星座
哪些星座的本质是柠檬精，经常莫名其妙就酸了
10月里工作运势大涨！事业有好转的生肖！
习惯逆来顺受，有委屈自己也不说的生肖！
辞旧迎新的新月来了，12星座好运全方位攻略
好桃花集中在年轻时的星座
游戏 
 

《奥特银河格斗 新生代英雄》之银河奥特曼
情怀写如诗
另类中单薇恩领衔，各种新套路解析
S9开赛在即，RNG狼行韩服未上大师改ID，心态很重要！
可以玩一天不觉得腻的游戏
拿到这几种武器，吃鸡率提高百分之三十！
GodLie：经典怀旧狼王篇，JY狼王大获全胜！
财报 
 

腾讯公布2019年第二季度及中期业绩

腾讯公布2019年第一季度业绩
腾讯公布2018年第四季度及全年业绩
腾讯公布2018年第三季度业绩
腾讯公布2018年第二季度及中期业绩
腾讯公布2018年第一季度业绩
高清组图 

 
庆祝新中国成立70周年阅兵准备工作进展顺利
 
晚清诰命夫人老照片：相貌美丽惊艳，气质端庄不凡！
 
农村大叔吹糖人30年，一个卖十块钱，能吃能玩还好看
 
在线影展：跨越50年的中国小学生黑白照，70后都看哭了
 
第一位阿联酋人进入太空，迪拜展开摘星之旅
 
孩子长高、大人减肥午餐，饭菜一起都齐了，比炒菜强，省事



关于腾讯 | About Tencent | 服务协议 | 隐私政策 | 开放平台 | 商务洽谈 | 腾讯招聘 | 腾讯公益 | 客服中心 | 网站导航 | 客户端下载 | 版权所有
深圳举报中心 | 深圳公安局 | 抵制违法广告承诺书 | 版权保护投诉指引 | 广东省通管局
粤网文[2017]6138-1456号 新出网证（粤）字010号 网络视听许可证1904073号 增值电信业务经营许可证：粤B2-20090059 B2-20090028 
新闻信息服务许可证 粤府新函[2001]87号 违法和不良信息举报电话：0755-83765566-9 粤公网安备 44030002000001号
互联网药品信息服务资格证书 （粤）—非营业性—2017-0153
Copyright 1998 - 2019 Tencent. All Rights Reserved 

经营性网站
备案信息

中国互联网
举报中心

中国文明网
传播文明


工商网监
电子标识
'''

if __name__ == '__main__':
    import time
    import jieba

    while True:
        keywords = input("关键字: ")
        start_time = time.time()
        keys = [k.strip() for k in jieba.cut(keywords) if k.strip()]
        print(keys)
        results = []
        for line in content.splitlines():
            ifmatch = True
            for keyword in keys:
                if keyword not in line:
                    ifmatch = False
                else:
                    line = line.replace(keyword, "**{}**".format(keyword))
            if ifmatch:
                results.append(line)
        end_time = time.time()
        print(f"共找到{len(results)}个结果, 用时 {end_time-start_time}s:")
        for index, result in enumerate(results):
            print(index+1, ".", result)
